//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

// let num1 = +prompt("Enter number");
// let num2 = +prompt("Enter number");
//
// if(num1>num2){
//     console.log(num1);
// }
// else if(num2>num1){
//     console.log(num2);
// }
// else {
//     console.log(`Числа рівні і дорівнюють ${num2}`);
// }


//- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.


// let num = + prompt("Номер квартири?");
//
// if(num <=20){
//     console.log("Перший під'їзд");
// }
// else if(num > 20 && num <=48){
//     console.log("Другий під'їзд");
// }
// else if(num > 48 && num<90) {
//     console.log("Третій під'їзд");
// }
// else{
//     console.log("Квартири не існує");
// }


//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt("Enter number");
//
// let numberHelp = number === 10 ? 'ВІРНО' : 'НЕВІРНО';
//
// console.log(numberHelp);

//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = 100;
// let x = [1,2,3,4];
// let x = "Hello world";
// let x = {
//     name: "question",
// }
// let x = true;
// let x = undefined;

//
// if(typeof x === "number"){
//     console.log("1");
// }
// else if(typeof x === "string"){
//     console.log("2");
// }
// else if(typeof x === "boolean"){
//     console.log("3");
// }
// else if(typeof x === "object") {
//     console.log("4");
// }
// else
// {
//     console.log("I don`t know");
// }


//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН


// let temperature = +prompt("Enter temperature");
//
// if(temperature < 10 || temperature > 22){
//     console.log("сидимо вдома і вчимося ОНЛАЙН");
// }
// else {
//     console.log("ми йдемо ВЧИТИСЯ");
// }


//- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .


// let key = +prompt("Enter number");
//
// switch (key){
//     case 1:
//         console.log("Ти виграв окуляри");
//         break;
//     case 2:
//         console.log("Ти виграв телефон");
//         break;
//     case 3:
//         console.log("Ти виграв авто");
//         break;
//     case 4:
//         console.log("Ти виграв ноутбук");
//         break;
//     case 5:
//         console.log("Ти виграв мишку");
//         break;
//     default:
//         console.log("Сьогодні не твій день, число не вірне");
// }